print(0)


"""
config.vm.network "forwarded_port", guest: 8000, host: 80
Guest VM 内部的 8000 端口 → 被映射到 Host 宿主机的 80 端口

config.vm.network "private_network", ip: "192.168.33.10"
宿主机可以直接访问虚拟机 IP 为 192.168.33.10，端口不变

python manage.py runserver 0.0.0.0:8000
它监听的是 虚拟机内部 的 8000 端口

✅ 结论：宿主机能访问：
| 访问方式                        | 是否成功 | 原因                            |
| --------------------------- | ---- | ----------------------------------- |
| `http://localhost:80`       | ✅    | host:80 → forwarded to guest:8000  |
| `http://127.0.0.1:80`       | ✅    | 同上                                |
| `http://192.168.33.10:8000` | ✅    | 直连虚拟机私网 IP + 真实 8000 端口     |

❌ 宿主机不能访问：
| 访问方式                      | 是否成功 | 原因                          |
| ------------------------- | ---- | -------------------------------    |
| `http://localhost:8000`   | ❌    | 宿主机上并没有进程监听 8000          |
| `http://127.0.0.1:8000`   | ❌    | 同上                              |
| `http://192.168.33.10:80` | ❌    | 80 并没有映射回去，也没有在 VM 上监听 |


python manage.py runserver [127.0.0.1:8000]
只监听本机回环地址, 只有虚拟机内部能访问

| 访问者                                       | 是否能访问  | 原因                         |
| ------------------------------------------- | --------- | ---------------------------- |
| 虚拟机内部自己访问 `http://127.0.0.1:8000`     | ✅ 可以   | 本机访问本机                   |
| 宿主机访问 `localhost:8000`|`127.0.0.1:8000` | ❌ 不行    | 宿主机和虚拟机是两个不同的“本机”  |
| 宿主机访问 `192.168.33.10:8000`              | ❌ 不行    | Django 没监听虚拟机的对外网络接口 |

================================================================================================================

@action(methods=['POST'], detail=True, permission_classes=[IsAuthenticated])
detail=True 的 actions 会默认先去调用 get_object() {get_object_or_404()} 也就是
queryset.filter(pk=1) 查询一下这个 object 在不在

"""